In [1]:
import mysql.connector

import datetime

import csv

import pandas as pd

from sqlalchemy import create_engine

import yfinance as yf

In [22]:
import pymysql
connection = pymysql.connect(host='127.0.0.1',
                             user='root',
                             password='PApOEaPbJNOM62p1',
                             db='stockdb'
                            ,port=1234)

In [23]:
cur = connection.cursor()

In [4]:
now=datetime.date.today()
start = datetime.datetime(2020, 1, 1)
end = now

In [5]:
def companydata(file):
    companyfull=list()
    with open(file, newline='') as csvfile:
        reader = csv.DictReader(csvfile)
        #next(reader)
        for row in reader:
            companyfull.append(row)
    company=pd.DataFrame(companyfull)
    return company

In [6]:
company=companydata('500.csv')
companysymbol=company["Symbol"].tolist()
company1=company.drop(columns=['Name'])
Symbols=company['Symbol'].tolist()

In [18]:
#cur.execute("CREATE TABLE test1 (Ticker TEXT)")
#cur.execute("DROP TABLE CompanyInfo")
#cur.execute("DROP TABLE CompanyInfo")

0

In [43]:
#cur.execute("CREATE TABLE CompanyInformation(symbol VARCHAR(250),name VARCHAR(250),sector VARCHAR(250),PRIMARY KEY (symbol))")

0

In [133]:
cur.execute("DROP TABLE MMM")

0

In [114]:
cur.execute("SHOW TABLES")

1

In [86]:

TABLENAME = cur.fetchall()
TABLENAME

(('CompanyInformation',), ('M',))

In [101]:
cur.execute("SHOW TABLES")

2

In [41]:
company["new_name"] = company['Name'].str.replace("[']",'')

In [42]:
company

,Symbol,Name,Sector,new_name
0,MMM,3M Company,Industrials,3M Company
1,AOS,A.O. Smith Corp,Industrials,A.O. Smith Corp
2,ABT,Abbott Laboratories,Health Care,Abbott Laboratories
3,ABBV,AbbVie Inc.,Health Care,AbbVie Inc.
4,ABMD,ABIOMED Inc,Health Care,ABIOMED Inc
...,...,...,...,...
500,YUM,Yum! Brands Inc,Consumer Discretionary,Yum! Brands Inc
501,ZBRA,Zebra Technologies,Information Technology,Zebra Technologies
502,ZBH,Zimmer Biomet Holdings,Health Care,Zimmer Biomet Holdings
503,ZION,Zions Bancorp,Financials,Zions Bancorp
504,ZTS,Zoetis,Health Care,Zoetis

In [52]:
sqlcode1=('Select * From CompanyInformation')
cur.execute(sqlcode1)
test1 = cur.fetchone()
test1

('A', 'Agilent Technologies Inc', 'Health Care')

In [45]:
for row in company.iterrows():

    idx = row[0]
    symbol = row[1][0]
    name = row[1][3]
    sector = row[1][2]

    try: 
        cur.execute(f"INSERT INTO CompanyInformation (symbol,name,sector) VALUES ('{symbol}','{name}', '{sector}');")

    except Exception as e:
        print(e)
        continue

In [53]:
sqlcode1=('Select * From CompanyInformation Where Sector="Industrials"')
cur.execute(sqlcode1)
Industrials = cur.fetchone()
Industrials

('AAL', 'American Airlines Group', 'Industrials')

In [70]:
Symbols[0]

'MMM'

In [127]:
df.index

DatetimeIndex(['2020-01-02', '2020-01-03', '2020-01-06', '2020-01-07',
               '2020-01-08', '2020-01-09', '2020-01-10', '2020-01-13',
               '2020-01-14', '2020-01-15',
               ...
               '2020-10-23', '2020-10-26', '2020-10-27', '2020-10-28',
               '2020-10-29', '2020-10-30', '2020-11-02', '2020-11-03',
               '2020-11-04', '2020-11-05'],
              dtype='datetime64[ns]', name='Date', length=215, freq=None)

In [81]:
df['Stock Splits']

Date
2020-01-02    0
2020-01-03    0
2020-01-06    0
2020-01-07    0
2020-01-08    0
             ..
2020-10-30    0
2020-11-02    0
2020-11-03    0
2020-11-04    0
2020-11-05    0
Name: Stock Splits, Length: 215, dtype: int64

In [134]:
list1=['MMM']
for i in list1:
    symbol=yf.Ticker(i)
    df1 = symbol.history(start = start,end=end)
    try:
        cur.execute("CREATE TABLE "+i+"(date datetime,open float,high float,low float,close float,volume float,dividends float)")
        df1 = symbol.history(start = start,end=end)
        for index, row in df1.iterrows():
            #sqlcode=("INSERT INTO "+i+"(date,open,high,low,close,volume,dividends) values(?,?,?,?,?,?,?)", index,row.Open,row.High,row.Low,row.Close,row.Volume,row.Dividends)
            #cur.execute(f"INSERT INTO "+i+"(date,open,high,low,close,volume,dividends) VALUES ('index','{row.Open}', '{row.High}','{row.Low}','{row.Close}','{row.Volume}','{row.Dividends}');")
            
            
            #print(sqlcode)
            #cur.execute(sqlcode)
            cur.execute("INSERT INTO "+i+"(date,open,high,low,close,volume,dividends) values(?,?,?,?,?,?,?)", index,row.Open,row.High,row.Low,row.Close,row.Volume,row.Dividends)
    except Exception as e:
        print(e)
        continue

execute() takes from 2 to 3 positional arguments but 9 were given

In [ ]:
#cur.execute("CREATE TABLE "+i+"(date DATE,open float,high float,low float,close float,volume float,dividends float,stock_splits float)")
#df1 = symbol.history(start = start,end=end)
#cur.execute(f"INSERT INTO "+i+"(date,open,high,low,close,volume,dividends,stock_splits) VALUES ('{df.index}','{df['Open']}', '{df['High'],{df['Low']},{df['Close']},{df['Volume']},{df['Dividends']},{df['Stock Splits']}}');")

In [82]:
for i in Symbols[0]:
    symbol=yf.Ticker(i)
    df1 = symbol.history(start = start,end=end)
    #try:
        #cur.execute("CREATE TABLE "+i+"(date DATE,open float,high float,low float,close float,volume float,dividends float,stock_splits float)")
        #df1 = symbol.history(start = start,end=end)
        #cur.execute(f"INSERT INTO "+i+"(date,open,high,low,close,volume,dividends,stock_splits) VALUES ('{df.index}','{df['Open']}', '{df['High'],{df['Low']},{df['Close']},{df['Volume']},{df['Dividends']},{df['Stock Splits']}}');")
    #except:
        #continue

df.columns
#df.index

Index(['Open', 'High', 'Low', 'Close', 'Volume', 'Dividends', 'Stock Splits'], dtype='object')

In [88]:
sqlcode=('Select * From M')
cur.execute(sqlcode)
test2 = cur.fetchall()
test2

()

In [ ]:
def pastdata(Symbols):
    for i in Symbols:
        cur.execute("CREATE TABLE CompanyInformation(symbol VARCHAR(250),name VARCHAR(250),sector VARCHAR(250),PRIMARY KEY (symbol))")
        symbol=yf.Ticker(i)
        try:
            df = symbol.history(start = start,end=end)
            #df.to_sql(i, con = engine, if_exists = 'append', chunksize = 1000, index = True)
        except:
            continue